app/views/users/_report_form.html.erb

SELECT "projects".* FROM "projects"  ORDER BY "projects"."project_name" ASC
---
      <%= f.label :project_name, "Project:" %>
      <%= f.collection_select :id, Project.order(:project_name),:id,:project_name, include_blank: true %>