app/controllers/projects_controller.rb

INSERT INTO "projects" ("project_name", "plan_time", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_name", "Kaopiz HR"], ["plan_time", "9"], ["created_at", "2016-02-29 07:51:29.775289"], ["updated_at", "2016-02-29 07:51:29.775289"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @project = Project.find(params[:id])