app/controllers/signin_controller.rb

	def new
		if User.exists?(token: cookies[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "xoxp-2760961654-12911026562-23049778693-34fdc795fa"]]
SELECT  1 AS one FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "xoxp-2760961654-12911026562-23049778693-34fdc795fa"]]