app/controllers/users_controller.rb

  def report
  if logged_in?
    @user = current_user
  else
    token = auth(params[:code])
    if !User.exists?(token: token)
    new_user = get_user(token)
    @user = add_user(new_user["user"],new_user["admin"],token)
    else
      @user = User.find_by(token: token)
    end
    log_in @user
  end
    @project = Project.first
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "xoxp-2760961654-12911026562-23049778693-34fdc795fa"]]
SELECT  1 AS one FROM "users" WHERE "users"."token" = ? LIMIT 1  [["token", "xoxp-2760961654-12911026562-23049778693-34fdc795fa"]]
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" ASC LIMIT 1

  def report2
  	@project = Project.find(params[:project][:id])
  	project_name = @project.project_name
  	text = "[Project_name:]\n#{project_name}\n[Done:]\n#{params[:project][:hours]} hours\n[Problem:]\n#{params[:project][:problem]}\n[Next_plan:]\n#{params[:project][:next_plan]}"
  	@project.real_time += params[:project][:hours].to_i
  	@res = post_report(text, current_user.token)
     if @res.is_a?(Net::HTTPSuccess)
     flash.now[:success] = "#Successfully reported!"
     end
    if @project.update_attributes(user_project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "projects" SET "real_time" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["real_time", 1.0], ["updated_at", "2016-03-01 10:16:24.883542"], ["id", 1]]